/*******************************************************************************
 *   Filename:       cvi_file.h
 *   Revised:        All copyrights reserved to redmorningcn.
 *   Revision:       v1.0
 *   Writer:	     redmorningcn.
 *
 *   Description:    
		     双击选中 otr 按 Ctrl + H, 钩选 Match the case, Replace with
 *                   输入您要的名字，点击 Replace All
 *                   双击选中 Otr 按 Ctrl + H, 钩选 Match the case, Replace with
 *                   输入您要的名字，点击 Replace All
 *                   双击选中 OTR 按 Ctrl + H, 钩选 Match the case, Replace with
 *                   输入您要的名字，点击 Replace All
 *                   在 app_cfg.h 中指定本任务的 优先级  （ APP_TASK_COMM_PRIO     ）
 *                                            和 任务堆栈（ APP_TASK_COMM_STK_SIZE ）大小
 *
 *   Notes:
 *     				E-mail: redmorningcn@qq.com
 *
 *******************************************************************************/

#ifndef	CVI_FILE_H
#define	CVI_FILE_H

/********************************************************************************************/
/* Include files																			*/
/********************************************************************************************/
#include "asynctmr.h"
#include <utility.h>
#include <ansi_c.h>
#include <cvirte.h>		
#include <userint.h>
#include <formatio.h> 
#include <comconfig.h>         
#include "pc_csnr.h"    

/********************************************************************************************/
/* Constants																					*/
/********************************************************************************************/



/*******************************************************************************************
/结构体																				 
*******************************************************************************************/
typedef	struct	_stcfileinfo_
{
	int	handle;				//文件控件
	int	size;				//文件大小
	int	deallen;			//已处理长度
}stcFileInfo;

/********************************************************************************************/
/* Globals																					*/
/********************************************************************************************/
//串口结构体及通讯


/********************************************************************************************/
/* 从bin文件读取数据						                								*/
/********************************************************************************************/
int	ReadFileData(int	addr,char *buf,int	reclen);



void	SendFileData(void);

/*******************************************************************************
 *              end of file                                                    *
 *******************************************************************************/

#endif
